{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "x", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "x"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 11], "dtype": "float32", "input_dim": 20000, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 11}, "inbound_nodes": [[["x", 0, 0, {}]]]}, {"name": "x_pos", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11, 45], "dtype": "float32", "sparse": false, "name": "x_pos"}, "inbound_nodes": []}, {"name": "x_capital", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11, 5], "dtype": "float32", "sparse": false, "name": "x_capital"}, "inbound_nodes": []}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["embedding_1", 0, 0, {}], ["x_pos", 0, 0, {}], ["x_capital", 0, 0, {}]]]}, {"name": "spatial_dropout1d_1", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv1D", "config": {"name": "conv1", "trainable": true, "filters": 256, "kernel_size": [5], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]]}, {"name": "primarycap_conv1d", "class_name": "Conv1D", "config": {"name": "primarycap_conv1d", "trainable": true, "filters": 256, "kernel_size": [3], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "primarycap_reshape", "class_name": "Reshape", "config": {"name": "primarycap_reshape", "trainable": true, "target_shape": [-1, 8]}, "inbound_nodes": [[["primarycap_conv1d", 0, 0, {}]]]}, {"name": "primarycap_squash", "class_name": "Lambda", "config": {"name": "primarycap_squash", "trainable": true, "function": ["4wIAAAAAAAAABAAAAAUAAABDAAAAczwAAAB0AGoBdABqAnwAgwF8AWQBZAKNA30CfAJkA3wCFwAb\nAHQAagN8AnQAagSDABcAgwEbAH0DfAN8ABQAUwApBOEUAQAACiAgICBUaGUgbm9uLWxpbmVhciBh\nY3RpdmF0aW9uIHVzZWQgaW4gQ2Fwc3VsZS4gSXQgZHJpdmVzIHRoZSBsZW5ndGggb2YgYSBsYXJn\nZSB2ZWN0b3IgdG8gbmVhciAxIGFuZCBzbWFsbCB2ZWN0b3IgdG8gMAogICAgOnBhcmFtIHZlY3Rv\ncnM6IHNvbWUgdmVjdG9ycyB0byBiZSBzcXVhc2hlZCwgTi1kaW0gdGVuc29yCiAgICA6cGFyYW0g\nYXhpczogdGhlIGF4aXMgdG8gc3F1YXNoCiAgICA6cmV0dXJuOiBhIFRlbnNvciB3aXRoIHNhbWUg\nc2hhcGUgYXMgaW5wdXQgdmVjdG9ycwogICAgVCkB2ghrZWVwZGltc+kBAAAAKQXaAUvaA3N1bdoG\nc3F1YXJl2gRzcXJ02gdlcHNpbG9uKQRaB3ZlY3RvcnPaBGF4aXNaDnNfc3F1YXJlZF9ub3Jt2gVz\nY2FsZakAcgsAAAD6Ni9ob21lL2RodWJlci90bXAvQ2Fwc05ldF9mb3JfTkVSL2NvZGUvY2Fwc3Vs\nZWxheWVycy5wedoGc3F1YXNoQgAAAHMGAAAAAAcWAR4B\n", [-1], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["primarycap_reshape", 0, 0, {}]]]}, {"name": "nercaps", "class_name": "CapsuleLayer", "config": {"name": "nercaps", "trainable": true, "num_capsule": 9, "dim_capsule": 16}, "inbound_nodes": [[["primarycap_squash", 0, 0, {}]]]}, {"name": "decoder_y_cat", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "name": "decoder_y_cat"}, "inbound_nodes": []}, {"name": "masked_by_y", "class_name": "Mask", "config": {"name": "masked_by_y", "trainable": true}, "inbound_nodes": [[["nercaps", 0, 0, {}], ["decoder_y_cat", 0, 0, {}]]]}, {"name": "train_decoder_dense1", "class_name": "Dense", "config": {"name": "train_decoder_dense1", "trainable": true, "batch_input_shape": [null, 144], "dtype": "float32", "units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["masked_by_y", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["train_decoder_dense1", 0, 0, {}]]]}, {"name": "train_decoder_dense2", "class_name": "Dense", "config": {"name": "train_decoder_dense2", "trainable": true, "units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["train_decoder_dense2", 0, 0, {}]]]}, {"name": "out_pred", "class_name": "Length", "config": {"name": "out_pred", "trainable": true}, "inbound_nodes": [[["nercaps", 0, 0, {}]]]}, {"name": "train_decoder_output", "class_name": "Dense", "config": {"name": "train_decoder_output", "trainable": true, "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["x", 0, 0], ["x_pos", 0, 0], ["x_capital", 0, 0], ["decoder_y_cat", 0, 0]], "output_layers": [["out_pred", 0, 0], ["train_decoder_output", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}